[
  {
    "slug": "workplace-ageism-guide-2025",
    "title": "Fighting Workplace Ageism: A Complete Guide for Experienced Professionals in 2025",
    "excerpt": "Combat age discrimination in hiring with proven strategies. Learn how to modernize your approach, showcase value, and overcome ageist bias in the job market.",
    "author": "Hirelytica Team",
    "date": "June 28, 2025",
    "readTime": "12 min read"
  },
  {
    "slug": "ats-optimization-complete-guide-2025",
    "title": "Get Found by Recruiters: Complete ATS Optimization Guide 2025",
    "excerpt": "Evidence-based ATS optimization guide. Research shows 90-95% of resumes are reviewed by humans - learn how to get discovered by recruiters.",
    "author": "Hirelytica Team",
    "date": "June 28, 2025",
    "readTime": "15 min read"
  },
  {
    "slug": "cv-lottery-application-statistics-2025",
    "title": "The CV Lottery: Why 98% of Job Applications Disappear Into the Void",
    "excerpt": "Only 2% of job applications lead to interviews. Discover why ATS systems reject 75% of qualified candidates and how to beat the CV lottery with proven strategies.",
    "author": "Hirelytica Team",
    "date": "June 12, 2025",
    "readTime": "10 min read"
  },
  {
    "slug": "uk-job-market-crisis-2025",
    "title": "The UK Job Market Crisis: Why Finding Work Has Never Been Harder",
    "excerpt": "UK unemployment hits record highs while job vacancies remain unfilled. Explore the data behind the recruitment crisis and what it means for job seekers.",
    "author": "Hirelytica Team",
    "date": "May 28, 2025",
    "readTime": "8 min read"
  },
  {
    "slug": "why-recruitment-broken-data-2025",
    "title": "Why Global Recruitment is Fundamentally Broken in 2025",
    "excerpt": "The global hiring system is failing employers and candidates alike. Dive into the data showing why traditional recruitment methods no longer work.",
    "author": "Hirelytica Team",
    "date": "May 15, 2025",
    "readTime": "12 min read"
  }
]